unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
/**
  * FILE K1986VE1xI.h
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __K1986VE1xI_H
#define __K1986VE1xI_H

/** @addtogroup __CMSIS CMSIS
  * @{
  */

/** @addtogroup K1986VE1xI K1986VE1xI
  * @{
  */

/** @addtogroup K1986VE1xI_Peripheral K1986VE1xI Peripheral
  * @{
  */

#ifdef __cplusplus
extern "C" {
#endif

#if defined ( __CC_ARM   )
  #pragma anon_unions
#endif

/**
  * @brief K1986VE1xI Interrupt Number Definition
  */

typedef enum IRQn
{
/*----- Processor Exceptions Numbers -------------------------------------------*/
/* Attention for NonMaskableInt_IRQn: */
/* Called by software only (bit [31] of the ICSR register). Used for mission critical applications */
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt           */
  HardFault_IRQn              = -13,    /*!< 3 Hard Fault Interrupt             */
  SVCall_IRQn                 = -5,     /*!< 11 SV Call Interrupt               */
  PendSV_IRQn                 = -2,     /*!< 14 Pend SV Interrupt               */
  SysTick_IRQn                = -1,     /*!< 15 System Tick Interrupt           */

/*----- 1986EV3 specific Interrupt Numbers -------------------------------------*/
  MIL_STD_1553B2_IRQn         = 0,      /*!< MIL_STD_1553B2 Interrupt           */
  MIL_STD_1553B1_IRQn         = 1,      /*!< MIL_STD_1553B1 Interrupt           */
  USB_IRQn                    = 2,      /*!< USB Host Interrupt                 */
  CAN1_IRQn                   = 3,      /*!< CAN1 Interrupt                     */
  CAN2_IRQn                   = 4,      /*!< CAN2 Interrupt                     */
  DMA_IRQn                    = 5,      /*!< DMA Interrupt                      */
  UART1_IRQn                  = 6,      /*!< UART1 Interrupt                    */
  UART2_IRQn                  = 7,      /*!< UART2 Interrupt                    */
  SSP1_IRQn                   = 8,      /*!< SSP1 Interrupt                     */
  BUSY_IRQn                   = 9,      /*!< BUSY Interrupt                     */
  ARINC429R_IRQn              = 10,     /*!< ARINC429 Receiver Interrupt        */
  POWER_IRQn                  = 11,     /*!< POWER Detecor Interrupt            */
  WWDG_IRQn                   = 12,     /*!< Window Watchdog Interrupt          */
  TIMER4_IRQn                 = 13,     /*!< Timer4 Interrupt                   */
  TIMER1_IRQn                 = 14,     /*!< Timer1 Interrupt                   */
  TIMER2_IRQn                 = 15,     /*!< Timer2 Interrupt                   */
  TIMER3_IRQn                 = 16,     /*!< Timer3 Interrupt                   */
  ADC_IRQn                    = 17,     /*!< ADC Interrupt                      */
  ETHERNET_IRQn               = 18,     /*!< Ethernet Interrupt                 */
  SSP3_IRQn                   = 19,     /*!< SSP3 Interrupt                     */
  SSP2_IRQn                   = 20,     /*!< SSP2 Interrupt                     */
  ARINC429T1_IRQn             = 21,     /*!< ARINC429 Transmitter 1 Interrupt   */
  ARINC429T2_IRQn             = 22,     /*!< ARINC429 Transmitter 2 Interrupt   */
  ARINC429T3_IRQn             = 23,     /*!< ARINC429 Transmitter 3 Interrupt   */
  ARINC429T4_IRQn             = 24,     /*!< ARINC429 Transmitter 4 Interrupt   */
  BKP_IRQn                    = 27,     /*!< BACKUP Interrupt                   */
  EXT_INT1_IRQn               = 28,     /*!< EXT_INT1 Interrupt                 */
  EXT_INT2_IRQn               = 29,     /*!< EXT_INT2 Interrupt                 */
  EXT_INT3_IRQn               = 30,     /*!< EXT_INT3 Interrupt                 */
  EXT_INT4_IRQn               = 31      /*!< EXT_INT4 Interrupt                 */
}IRQn_Type;

/** @addtogroup Configuration_of_CMSIS Configuration of CMSIS
  * @{
  */
/* Configuration of the Processor and Core Peripherals */
#define __CM1_REV              0x0102   /*!< Core Revision                                */
#define __MPU_PRESENT             0     /*!< MPU present or not                           */
#define __NVIC_PRIO_BITS          2     /*!< Number of Bits used for Priority Levels      */
#define __Vendor_SysTickConfig    0     /*!< Set to 1 if different SysTick Config is used */

/** @} */ /* __Configuration_of_CMSIS */

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_config.h"
#include "core_cm1.h"
#include "system_K1986VE1xI.h"

/** @defgroup Exported_types Exported types
  * @{
  */
typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus, BitStatus;

#define IS_BIT_STATUS(STATUS)	(((STATUS) == RESET) || ((STATUS) == SET))

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** @} */ /* End of group __Exported_types */

/** @addtogroup Memory_Map Memory Map
  * @{
  */

#define ROM_BOOT_BASE            ((uint32_t)0x00000000)
#define ROM_BOOT_SIZE            ((uint32_t)0x00001000)

#define EEPROM_BASE              ((uint32_t)0x00000000)
#define EEPROM_SIZE              ((uint32_t)0x00020000)

#define EEPROM_FACTORY_DATA_BASE ((uint32_t)0x00000F80)
#define EEPROM_FACTORY_DATA_SIZE ((uint32_t)0x00000080)

#define EBC_CODE_BASE            ((uint32_t)0x00000000)
#define EBC_CODE_SIZE            ((uint32_t)0x20000000)

#define EBC_CODE_ITCMLA_BASE     ((uint32_t)0x00100000)
#define EBC_CODE_ITCMLA_SIZE     ((uint32_t)0x1FF00000)

#define RAM_DTCM_BASE            ((uint32_t)0x20000000)
#define RAM_DTCM_SIZE            ((uint32_t)0x00008000)

#define RAM_AHB_BASE             ((uint32_t)0x20100000)
#define RAM_AHB_SIZE             ((uint32_t)0x00004000)

#define ETH1_REG_BASE            ((uint32_t)0x30000000)
#define ETH1_REG_SIZE            ((uint32_t)0x00000038)

#define ETH1_RAM_BASE            ((uint32_t)0x38000000)
#define ETH1_RAM_SIZE            ((uint32_t)0x00002000)

#define PERIPH_BASE              ((uint32_t)0x40000000)
#define PERIPH_SIZE              ((uint32_t)0x00100000)

#define EBC_PERIPH_BASE          ((uint32_t)0x50000000)
#define EBC_PERIPH_SIZE          ((uint32_t)0x10000000)

#define EBC_RAM_BASE             ((uint32_t)0x60000000)
#define EBC_RAM_SIZE             ((uint32_t)0x40000000)

#define EBC_DEVICE_BASE          ((uint32_t)0xA0000000)
#define EBC_DEVICE_SIZE          ((uint32_t)0x40000000)

/** @} */ /* End of group Memory_Map */

/** @defgroup Peripheral_Memory_Map Peripheral Memory Map
  * @{
  */

#define MDR_CAN1_BASE          (PERIPH_BASE + (uint32_t)0x00000000)
#define MDR_CAN2_BASE          (PERIPH_BASE + (uint32_t)0x00008000)
#define MDR_USB_BASE           (PERIPH_BASE + (uint32_t)0x00010000)
#define MDR_EEPROM_BASE        (PERIPH_BASE + (uint32_t)0x00018000)
#define MDR_RST_CLK_BASE       (PERIPH_BASE + (uint32_t)0x00020000)
#define MDR_DMA_BASE           (PERIPH_BASE + (uint32_t)0x00028000)
#define MDR_UART1_BASE         (PERIPH_BASE + (uint32_t)0x00030000)
#define MDR_UART2_BASE         (PERIPH_BASE + (uint32_t)0x00038000)
#define MDR_SSP1_BASE          (PERIPH_BASE + (uint32_t)0x00040000)
#define MDR_MIL_STD_15531_BASE (PERIPH_BASE + (uint32_t)0x00048000)
#define MDR_MIL_STD_15532_BASE (PERIPH_BASE + (uint32_t)0x00050000)
#define MDR_POWER_BASE         (PERIPH_BASE + (uint32_t)0x00058000)
#define MDR_WWDG_BASE          (PERIPH_BASE + (uint32_t)0x00060000)
#define MDR_IWDG_BASE          (PERIPH_BASE + (uint32_t)0x00068000)
#define MDR_TIMER1_BASE        (PERIPH_BASE + (uint32_t)0x00070000)
#define MDR_TIMER2_BASE        (PERIPH_BASE + (uint32_t)0x00078000)
#define MDR_TIMER3_BASE        (PERIPH_BASE + (uint32_t)0x00080000)
#define MDR_ADC_BASE           (PERIPH_BASE + (uint32_t)0x00088000)
#define MDR_DAC_BASE           (PERIPH_BASE + (uint32_t)0x00090000)
#define MDR_TIMER4_BASE        (PERIPH_BASE + (uint32_t)0x00098000)
#define MDR_SSP2_BASE          (PERIPH_BASE + (uint32_t)0x000A0000)
#define MDR_PORTA_BASE         (PERIPH_BASE + (uint32_t)0x000A8000)
#define MDR_PORTB_BASE         (PERIPH_BASE + (uint32_t)0x000B0000)
#define MDR_PORTC_BASE         (PERIPH_BASE + (uint32_t)0x000B8000)
#define MDR_PORTD_BASE         (PERIPH_BASE + (uint32_t)0x000C0000)
#define MDR_PORTE_BASE         (PERIPH_BASE + (uint32_t)0x000C8000)
#define MDR_ARINC429R_BASE     (PERIPH_BASE + (uint32_t)0x000D0000)
#define MDR_BKP_BASE           (PERIPH_BASE + (uint32_t)0x000D8000)
#define MDR_ARINC429T_BASE     (PERIPH_BASE + (uint32_t)0x000E0000)
#define MDR_PORTF_BASE         (PERIPH_BASE + (uint32_t)0x000E8000)
#define MDR_EBC_BASE           (PERIPH_BASE + (uint32_t)0x000F0000)
#define MDR_SSP3_BASE          (PERIPH_BASE + (uint32_t)0x000F8000)
#define MDR_ETHERNET1_BASE     (ETH1_REG_BASE + (uint32_t)0x00000000)

/** @} */ /* End of group Peripheral_Memory_Map */

/** @addtogroup __K1986VE1xI_Memory_Units K1986VE1xI Memory Units
  * @{
  */

/** @defgroup K1986VE1xI_Memory_EEPROM_FACTORY_DATA EEPROM FACTORY_DATA
  * @{
  */

