unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
/** @defgroup K1986VE1xI_Memory_EEPROM_FACTORY_DATA_Addresses_for_Register_Access Addresses for Register Access
  * @{
  */

#define EEPROM_FACTORY_DATA_LSI_TRIM  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000000)
#define EEPROM_FACTORY_DATA_HSI_TRIM  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000010)
#define EEPROM_FACTORY_DATA_LDO_TRIM  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000020)
#define EEPROM_FACTORY_DATA_UNIQ_ID0  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000030)
#define EEPROM_FACTORY_DATA_UNIQ_ID1  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000040)
#define EEPROM_FACTORY_DATA_UNIQ_ID2  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000050)
#define EEPROM_FACTORY_DATA_UNIQ_ID3  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000060)
#define EEPROM_FACTORY_DATA_UNIQ_ID4  (EEPROM_FACTORY_DATA_BASE + (uint32_t)0x00000070)

/** @} */ /* End of group K1986VE1xI_Memory_EEPROM_FACTORY_DATA_Addresses_for_Register_Access */

/** @defgroup K1986VE1xI_Memory_EEPROM_FACTORY_DATA_Defines Defines
  * @{
  */

/** @defgroup Memory_EEPROM_FACTORY_DATA_LSI_TRIM EEPROM FACTORY_DATA LSI_TRIM
  * @{
  */

/*-- EEPROM_FACTORY_DATA_LSI_TRIM: EEPROM FACTORY_DATA LSI_TRIM Field -----*/
/* Bit field positions: */
#define EEPROM_FACTORY_DATA_LSI_TRIM_LSI_TRIM_Pos  0

/* Bit field masks: */
#define EEPROM_FACTORY_DATA_LSI_TRIM_LSI_TRIM_Msk  ((uint32_t)0x0000001F)

/** @} */ /* End of group Memory_EEPROM_FACTORY_DATA_LSI_TRIM */

/** @defgroup Memory_EEPROM_FACTORY_DATA_HSI_TRIM EEPROM FACTORY_DATA HSI_TRIM
  * @{
  */

/*-- EEPROM_FACTORY_DATA_HSI_TRIM: EEPROM FACTORY_DATA HSI_TRIM Field -----*/
/* Bit field positions: */
#define EEPROM_FACTORY_DATA_HSI_TRIM_HSI_TRIM_Pos  0

/* Bit field masks: */
#define EEPROM_FACTORY_DATA_HSI_TRIM_HSI_TRIM_Msk  ((uint32_t)0x0000003F)

/** @} */ /* End of group Memory_EEPROM_FACTORY_DATA_HSI_TRIM */

/** @defgroup Memory_EEPROM_FACTORY_DATA_LDO_TRIM EEPROM FACTORY_DATA LDO_TRIM
  * @{
  */

/*-- EEPROM_FACTORY_DATA_LDO_TRIM: EEPROM FACTORY_DATA LDO_TRIM Field -----*/
/* Bit field positions: */
#define EEPROM_FACTORY_DATA_LDO_TRIM_LDO_TRIM_Pos  0

/* Bit field masks: */
#define EEPROM_FACTORY_DATA_LDO_TRIM_LDO_TRIM_Msk  ((uint32_t)0x00000007)

/** @} */ /* End of group Memory_EEPROM_FACTORY_DATA_LDO_TRIM */

/** @defgroup Memory_EEPROM_FACTORY_DATA_UNIQ_IDx EEPROM FACTORY_DATA UNIQ_IDx
  * @{
  */

/*-- EEPROM_FACTORY_DATA_UNIQ_IDx: EEPROM FACTORY_DATA UNIQ_IDx Field -----*/
/* Bit field positions: */
#define EEPROM_FACTORY_DATA_UNIQ_IDx_UNIQ_IDx_Pos  0

/* Bit field masks: */
#define EEPROM_FACTORY_DATA_UNIQ_IDx_UNIQ_IDx_Msk  ((uint32_t)0xFFFFFFFF)

/** @} */ /* End of group Memory_EEPROM_FACTORY_DATA_UNIQ_IDx */

/** @} */ /* End of group K1986VE1xI_Memory_EEPROM_FACTORY_DATA_Defines */

/** @} */ /* End of group K1986VE1xI_Memory_EEPROM_FACTORY_DATA */

/** @} */ /* End of group __K1986VE1xI_Memory_Units */

/** @defgroup __K1986VE1xI_Peripheral_Units K1986VE1xI Peripheral Units
  * @{
  */

/** @defgroup K1986VE1xI_Periph_CAN CAN
  * @{
  */

/** @defgroup K1986VE1xI_CAN_Data_Structures Data Structures
  * @{
  */

/* MDR_CAN_BUF_TypeDef structure */
typedef struct
{
  __IO uint32_t ID;
  __IO uint32_t DLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
}MDR_CAN_BUF_TypeDef;

/* MDR_CAN_BUF_FILTER_TypeDef structure */
typedef struct
{
  __IO uint32_t MASK;
  __IO uint32_t FILTER;
}MDR_CAN_BUF_FILTER_TypeDef;

/* MDR_CAN_TypeDef structure */
typedef struct
{
  __IO uint32_t CONTROL;
  __IO uint32_t STATUS;
  __IO uint32_t BITTMNG;
       uint32_t RESERVED0;
  __IO uint32_t INT_EN;
       uint32_t RESERVED1[2];
  __IO uint32_t OVER;
  __IO uint32_t RXID;
  __IO uint32_t RXDLC;
  __IO uint32_t RXDATAL;
  __IO uint32_t RXDATAH;
  __IO uint32_t TXID;
  __IO uint32_t TXDLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
  __IO uint32_t BUF_CON[32];
  __IO uint32_t INT_RX;
  __IO uint32_t RX;
  __IO uint32_t INT_TX;
  __IO uint32_t TX;
       uint32_t RESERVED2[76];
    MDR_CAN_BUF_TypeDef CAN_BUF[32];
       uint32_t RESERVED3[64];
    MDR_CAN_BUF_FILTER_TypeDef CAN_BUF_FILTER[32];
}MDR_CAN_TypeDef;

/** @} */ /* End of group __K1986VE1xI_CAN_Data_Structures */

/** @defgroup K1986VE1xI_Periph_CAN_Defines Defines
  * @{
  */

/** @defgroup __K1986VE1xI_Periph_CAN_CONTROL	CAN CONTROL
  * @{
  */ 

/*-- CAN_CONTROL: CAN Control Register -----------------------------*/
/* Bit field positions: */
#define CAN_CONTROL_CAN_EN_Pos                  0
#define CAN_CONTROL_ROM_Pos                     1
#define CAN_CONTROL_STM_Pos                     2
#define CAN_CONTROL_SAP_Pos                     3
#define CAN_CONTROL_ROP_Pos                     4

/* Bit field masks: */
#define CAN_CONTROL_CAN_EN                      ((uint32_t)0x00000001)
#define CAN_CONTROL_ROM                         ((uint32_t)0x00000002)
#define CAN_CONTROL_STM                         ((uint32_t)0x00000004)
#define CAN_CONTROL_SAP                         ((uint32_t)0x00000008)
#define CAN_CONTROL_ROP                         ((uint32_t)0x00000010)

/** @} */ /* End of group CAN_CONTROL */

/** @defgroup __K1986VE1xI_Periph_CAN_STATUS	CAN STATUS
  * @{
  */ 

/*-- CAN_STATUS: CAN Status Register -------------------------------*/
/* Bit field positions: */
#define CAN_STATUS_RX_READY_Pos                 0
#define CAN_STATUS_TX_READY_Pos                 1
#define CAN_STATUS_ERROR_OVER_Pos               2
#define CAN_STATUS_BIT_ERR_Pos                  3
#define CAN_STATUS_BIT_STUFF_ERR_Pos            4
#define CAN_STATUS_CRC_ERR_Pos                  5
#define CAN_STATUS_FRAME_ERR_Pos                6
#define CAN_STATUS_ACK_ERR_Pos                  7
#define CAN_STATUS_IDLOWER_Pos                  8
#define CAN_STATUS_ERR_STATUS_Pos               9
#define CAN_STATUS_RX_ERR_CNT8_Pos              11
#define CAN_STATUS_TX_ERR_CNT8_Pos              12
#define CAN_STATUS_RX_ERR_CNT_Pos               16
#define CAN_STATUS_TX_ERR_CNT_Pos               24

/* Bit field masks: */
#define CAN_STATUS_RX_READY                     ((uint32_t)0x00000001)
#define CAN_STATUS_TX_READY                     ((uint32_t)0x00000002)
#define CAN_STATUS_ERROR_OVER                   ((uint32_t)0x00000004)
#define CAN_STATUS_BIT_ERR                      ((uint32_t)0x00000008)
#define CAN_STATUS_BIT_STUFF_ERR                ((uint32_t)0x00000010)
#define CAN_STATUS_CRC_ERR                      ((uint32_t)0x00000020)
#define CAN_STATUS_FRAME_ERR                    ((uint32_t)0x00000040)
#define CAN_STATUS_ACK_ERR                      ((uint32_t)0x00000080)
#define CAN_STATUS_IDLOWER                      ((uint32_t)0x00000100)
#define CAN_STATUS_ERR_STATUS_Msk               ((uint32_t)0x00000600)
#define CAN_STATUS_RX_ERR_CNT8                  ((uint32_t)0x00000800)
#define CAN_STATUS_TX_ERR_CNT8                  ((uint32_t)0x00001000)
#define CAN_STATUS_RX_ERR_CNT_Msk               ((uint32_t)0x00FF0000)
#define CAN_STATUS_TX_ERR_CNT_Msk               ((uint32_t)0xFF000000)

/** @} */ /* End of group CAN_STATUS */

