unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
#define RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_Pos         3
#define RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_Msk         (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_EEPROM             RST_CLK_PER_CLOCK_PCLK_EN_EEPROM_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK_Pos        4
#define RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK_Msk        (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK            RST_CLK_PER_CLOCK_PCLK_EN_RST_CLK_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_DMA_Pos            5
#define RST_CLK_PER_CLOCK_PCLK_EN_DMA_Msk            (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_DMA_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_DMA                RST_CLK_PER_CLOCK_PCLK_EN_DMA_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_UART1_Pos          6
#define RST_CLK_PER_CLOCK_PCLK_EN_UART1_Msk          (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_UART1_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_UART1              RST_CLK_PER_CLOCK_PCLK_EN_UART1_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_UART2_Pos          7
#define RST_CLK_PER_CLOCK_PCLK_EN_UART2_Msk          (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_UART2_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_UART2              RST_CLK_PER_CLOCK_PCLK_EN_UART2_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_SSP1_Pos           8
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP1_Msk           (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_SSP1_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP1               RST_CLK_PER_CLOCK_PCLK_EN_SSP1_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B1_Pos 9
#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B1_Msk (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B1_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B1     RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B1_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B2_Pos 10
#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B2_Msk (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B2_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B2     RST_CLK_PER_CLOCK_PCLK_EN_MIL_STD_1553B2_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_POWER_Pos          11
#define RST_CLK_PER_CLOCK_PCLK_EN_POWER_Msk          (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_POWER_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_POWER              RST_CLK_PER_CLOCK_PCLK_EN_POWER_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_WWDG_Pos           12
#define RST_CLK_PER_CLOCK_PCLK_EN_WWDG_Msk           (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_WWDG_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_WWDG               RST_CLK_PER_CLOCK_PCLK_EN_WWDG_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_IWDG_Pos           13
#define RST_CLK_PER_CLOCK_PCLK_EN_IWDG_Msk           (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_IWDG_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_IWDG               RST_CLK_PER_CLOCK_PCLK_EN_IWDG_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER1_Pos         14
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER1_Msk         (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_TIMER1_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER1             RST_CLK_PER_CLOCK_PCLK_EN_TIMER1_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER2_Pos         15
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER2_Msk         (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_TIMER2_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER2             RST_CLK_PER_CLOCK_PCLK_EN_TIMER2_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER3_Pos         16
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER3_Msk         (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_TIMER3_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER3             RST_CLK_PER_CLOCK_PCLK_EN_TIMER3_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_ADC_Pos            17
#define RST_CLK_PER_CLOCK_PCLK_EN_ADC_Msk            (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_ADC_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_ADC                RST_CLK_PER_CLOCK_PCLK_EN_ADC_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_DAC_Pos            18
#define RST_CLK_PER_CLOCK_PCLK_EN_DAC_Msk            (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_DAC_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_DAC                RST_CLK_PER_CLOCK_PCLK_EN_DAC_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER4_Pos         19
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER4_Msk         (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_TIMER4_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_TIMER4             RST_CLK_PER_CLOCK_PCLK_EN_TIMER4_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_SSP2_Pos           20
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP2_Msk           (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_SSP2_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP2               RST_CLK_PER_CLOCK_PCLK_EN_SSP2_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTA_Pos          21
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTA_Msk          (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTA_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTA              RST_CLK_PER_CLOCK_PCLK_EN_PORTA_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTB_Pos          22
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTB_Msk          (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTB_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTB              RST_CLK_PER_CLOCK_PCLK_EN_PORTB_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTC_Pos          23
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTC_Msk          (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTC_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTC              RST_CLK_PER_CLOCK_PCLK_EN_PORTC_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTD_Pos          24
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTD_Msk          (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTD_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTD              RST_CLK_PER_CLOCK_PCLK_EN_PORTD_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_PORTE_Pos          25
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTE_Msk          (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTE_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTE              RST_CLK_PER_CLOCK_PCLK_EN_PORTE_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429R_Pos      26
#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429R_Msk      (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_ARINC429R_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429R          RST_CLK_PER_CLOCK_PCLK_EN_ARINC429R_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_BKP_Pos            27
#define RST_CLK_PER_CLOCK_PCLK_EN_BKP_Msk            (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_BKP_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_BKP                RST_CLK_PER_CLOCK_PCLK_EN_BKP_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429T_Pos      28
#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429T_Msk      (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_ARINC429T_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_ARINC429T          RST_CLK_PER_CLOCK_PCLK_EN_ARINC429T_Msk

