unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTF_Pos          29
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTF_Msk          (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_PORTF_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_PORTF              RST_CLK_PER_CLOCK_PCLK_EN_PORTF_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_EBC_Pos            30
#define RST_CLK_PER_CLOCK_PCLK_EN_EBC_Msk            (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_EBC_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_EBC                RST_CLK_PER_CLOCK_PCLK_EN_EBC_Msk

#define RST_CLK_PER_CLOCK_PCLK_EN_SSP3_Pos           31
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP3_Msk           (0x1UL << RST_CLK_PER_CLOCK_PCLK_EN_SSP3_Pos)
#define RST_CLK_PER_CLOCK_PCLK_EN_SSP3               RST_CLK_PER_CLOCK_PCLK_EN_SSP3_Msk

/* Bit field positions: */
#define RST_CLK_PER_CLOCK_PCLK_EN_Pos                0

/* Bit field masks: */
#define RST_CLK_PER_CLOCK_PCLK_EN_Msk                ((uint32_t)0xFFFFFFFF)

/** @} */ /* End of group RST_CLK_PER_CLOCK */

/** @defgroup __K1986VE1xI_Periph_RST_CLK_CAN_CLOCK	RST CLK CAN CLOCK
  * @{
  */ 

/*-- RST_CLK_CAN_CLOCK: CAN Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_CAN_CLOCK_CAN1_BRG_Pos          0
#define RST_CLK_CAN_CLOCK_CAN2_BRG_Pos          8
#define RST_CLK_CAN_CLOCK_CAN1_CLK_EN_Pos       24
#define RST_CLK_CAN_CLOCK_CAN2_CLK_EN_Pos       25

/* Bit field masks: */
#define RST_CLK_CAN_CLOCK_CAN1_BRG_Msk          ((uint32_t)0x000000FF)
#define RST_CLK_CAN_CLOCK_CAN2_BRG_Msk          ((uint32_t)0x0000FF00)
#define RST_CLK_CAN_CLOCK_CAN1_CLK_EN           ((uint32_t)0x01000000)
#define RST_CLK_CAN_CLOCK_CAN2_CLK_EN           ((uint32_t)0x02000000)

/** @} */ /* End of group RST_CLK_CAN_CLOCK */


/** @defgroup __K1986VE1xI_Periph_RST_CLK_TIM_CLOCK	RST CLK TIM CLOCK
  * @{
  */ 

/*-- RST_CLK_TIM_CLOCK: Timer Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_TIM_CLOCK_TIM1_BRG_Pos          0
#define RST_CLK_TIM_CLOCK_TIM2_BRG_Pos          8
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Pos          16
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Pos       24
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN_Pos       25
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN_Pos       26

/* Bit field masks: */
#define RST_CLK_TIM_CLOCK_TIM1_BRG_Msk          ((uint32_t)0x000000FF)
#define RST_CLK_TIM_CLOCK_TIM2_BRG_Msk          ((uint32_t)0x0000FF00)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Msk          ((uint32_t)0x00FF0000)
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN           ((uint32_t)0x01000000)
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN           ((uint32_t)0x02000000)
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN           ((uint32_t)0x04000000)

/** @} */ /* End of group RST_CLK_TIM_CLOCK */


/** @defgroup __K1986VE1xI_Periph_RST_CLK_UART_CLOCK	RST CLK UART CLOCK
  * @{
  */ 

/*-- RST_CLK_UART_CLOCK: UART Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_UART_CLOCK_UART1_BRG_Pos        0
#define RST_CLK_UART_CLOCK_UART2_BRG_Pos        8
#define RST_CLK_UART_CLOCK_TIM4_BRG_Pos         16
#define RST_CLK_UART_CLOCK_UART1_CLK_EN_Pos     24
#define RST_CLK_UART_CLOCK_UART2_CLK_EN_Pos     25
#define RST_CLK_UART_CLOCK_TIM4_CLK_EN_Pos      26

/* Bit field masks: */
#define RST_CLK_UART_CLOCK_UART1_BRG_Msk        ((uint32_t)0x000000FF)
#define RST_CLK_UART_CLOCK_UART2_BRG_Msk        ((uint32_t)0x0000FF00)
#define RST_CLK_UART_CLOCK_TIM4_BRG_Msk         ((uint32_t)0x00FF0000)
#define RST_CLK_UART_CLOCK_UART1_CLK_EN         ((uint32_t)0x01000000)
#define RST_CLK_UART_CLOCK_UART2_CLK_EN         ((uint32_t)0x02000000)
#define RST_CLK_UART_CLOCK_TIM4_CLK_EN          ((uint32_t)0x04000000)

/** @} */ /* End of group RST_CLK_UART_CLOCK */


/** @defgroup __K1986VE1xI_Periph_RST_CLK_SSP_CLOCK	RST CLK SSP CLOCK
  * @{
  */ 

/*-- RST_CLK_SSP_CLOCK: SSP Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_SSP_CLOCK_SSP1_BRG_Pos          0
#define RST_CLK_SSP_CLOCK_SSP2_BRG_Pos          8
#define RST_CLK_SSP_CLOCK_SSP3_BRG_Pos          16
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN_Pos       24
#define RST_CLK_SSP_CLOCK_SSP2_CLK_EN_Pos       25
#define RST_CLK_SSP_CLOCK_SSP3_CLK_EN_Pos       26

/* Bit field masks: */
#define RST_CLK_SSP_CLOCK_SSP1_BRG_Msk          ((uint32_t)0x000000FF)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_Msk          ((uint32_t)0x0000FF00)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_Msk          ((uint32_t)0x00FF0000)
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN           ((uint32_t)0x01000000)
#define RST_CLK_SSP_CLOCK_SSP2_CLK_EN           ((uint32_t)0x02000000)
#define RST_CLK_SSP_CLOCK_SSP3_CLK_EN           ((uint32_t)0x04000000)

/** @} */ /* End of group RST_CLK_SSP_CLOCK */



/** @defgroup __K1986VE1xI_Periph_RST_CLK_ETH_CLOCK	RST CLK ETR CLOCK
  * @{
  */ 

/*-- RST_CLK_ETH_CLOCK: ETR Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_ETH_CLOCK_ETH_BRG_Pos           0
#define RST_CLK_ETH_CLOCK_MAN_BRG_Pos           8
#define RST_CLK_ETH_CLOCK_PHY_BRG_Pos           16
#define RST_CLK_ETH_CLOCK_ETH_CLK_EN_Pos        24
#define RST_CLK_ETH_CLOCK_MAN_CLK_EN_Pos        25
#define RST_CLK_ETH_CLOCK_SLEEP_Pos             26
#define RST_CLK_ETH_CLOCK_PHY_CLK_EN_Pos        27
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Pos       28
#define RST_CLK_ETH_CLOCK_ETH2_CLK_EN_Pos       30

/* Bit field masks: */
#define RST_CLK_ETH_CLOCK_ETH_BRG_Msk           ((uint32_t)0x000000FF)
#define RST_CLK_ETH_CLOCK_MAN_BRG_Msk           ((uint32_t)0x0000FF00)
#define RST_CLK_ETH_CLOCK_PHY_BRG_Msk           ((uint32_t)0x00FF0000)
#define RST_CLK_ETH_CLOCK_ETH_CLK_EN            ((uint32_t)0x01000000)
#define RST_CLK_ETH_CLOCK_MAN_CLK_EN            ((uint32_t)0x02000000)
#define RST_CLK_ETH_CLOCK_SLEEP                 ((uint32_t)0x04000000)
#define RST_CLK_ETH_CLOCK_PHY_CLK_EN            ((uint32_t)0x08000000)
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Msk       ((uint32_t)0x30000000)
#define RST_CLK_ETH_CLOCK_ETH2_CLK_EN           ((uint32_t)0x40000000)

/** @} */ /* End of group RST_CLK_ETH_CLOCK */

