unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
/** @defgroup __K1986VE1xI_Periph_TIMER_CH_CNTRL2	TIMER CH CNTRL2
  * @{
  */ 

/*-- TIMER_CH_CNTRL2: Timer Channel Control2 Register --------------*/
/* Bit field positions: */
#define TIMER_CH_CNTRL2_CHSEL1_Pos              0
#define TIMER_CH_CNTRL2_CCR1_EN_Pos             2
#define TIMER_CH_CNTRL2_CCRRLD_Pos              3
#define TIMER_CH_CNTRL2_EV_DELAY_Pos            4

/* Bit field masks: */
#define TIMER_CH_CNTRL2_CHSEL1_Msk              ((uint32_t)0x00000003)
#define TIMER_CH_CNTRL2_CCR1_EN                 ((uint32_t)0x00000004)
#define TIMER_CH_CNTRL2_CCRRLD                  ((uint32_t)0x00000008)
#define TIMER_CH_CNTRL2_EV_DELAY                ((uint32_t)0x00000010)

/** @} */ /* End of group TIMER_CH_CNTRL2 */

/** @} */ /* End of group Periph_TIMER_Defines */

/** @} */ /* End of group Periph_TIMER */

/** @defgroup K1986VE1xI_Periph_ADC ADC
  * @{
  */

/** @defgroup __K1986VE1xI_Periph_ADC_Data_Structures Data Structures
  * @{
  */

/** @defgroup __K1986VE1xI_Periph_ADC_TypeDef ADC_TypeDef
  * @{
  */

typedef struct {
  __IO uint32_t ADC1_CFG;		// 0x00
  __IO uint32_t ADC2_CFG;		// 0x04
  __IO uint32_t ADC1_H_LEVEL;	// 0x08
  __IO uint32_t RESERVED0;   	// 0x0c
  __IO uint32_t ADC1_L_LEVEL;	// 0x10
  __IO uint32_t RESERVED1;		// 0x14
  __IO uint32_t ADC1_RESULT;	// 0x18
  __IO uint32_t RESERVED2;		// 0x1C
  __IO uint32_t ADC1_STATUS;	// 0x20
  __IO uint32_t RESERVED3;   	// 0x24
  __IO uint32_t ADC1_CHSEL;		// 0x28
  __IO uint32_t RESERVED4;		// 0x2C
  __IO uint32_t ADC1_TRIM;		// 0x30
} MDR_ADC_TypeDef;

/** @} */ /* End of group Periph_ADC_TypeDef */

/** @} */ /* End of group Periph_ADC_Data_Structures */

/** @defgroup __K1986VE1xI_Periph_ADC_Defines Defines
  * @{
  */

/** @defgroup __K1986VE1xI_Periph_ADC1_CFG	ADC1 CFG
  * @{
  */ 

/*-- ADC1_CFG: ADC1 Configuration Register -------------------------*/
/* Bit field positions: */
#define ADC1_CFG_REG_ADON_Pos                   0
#define ADC1_CFG_REG_GO_Pos                     1
#define ADC1_CFG_REG_CLKS_Pos                   2
#define ADC1_CFG_REG_SAMPLE_Pos                 3
#define ADC1_CFG_REG_CHS_Pos                    4
#define ADC1_CFG_REG_CHCH_Pos                   9
#define ADC1_CFG_REG_RNGC_Pos                   10
#define ADC1_CFG_M_REF_Pos                      11
#define ADC1_CFG_REG_DIVCLK_Pos                 12
#define ADC1_CFG_SYNC_CONVER_Pos                16
#define ADC1_CFG_TS_EN_Pos                      17
#define ADC1_CFG_TS_BUF_EN_Pos                  18
#define ADC1_CFG_SEL_TS_Pos                     19
#define ADC1_CFG_SEL_VREF_Pos                   20
#define ADC1_CFG_RESERVED_Pos                   21
#define ADC1_CFG_DELAY_GO_Pos                   25
#define ADC1_CFG_DELAY_ADC_Pos                  28

/* Bit field masks: */
#define ADC1_CFG_REG_ADON                       ((uint32_t)0x00000001)
#define ADC1_CFG_REG_GO                         ((uint32_t)0x00000002)
#define ADC1_CFG_REG_CLKS                       ((uint32_t)0x00000004)
#define ADC1_CFG_REG_SAMPLE                     ((uint32_t)0x00000008)
#define ADC1_CFG_REG_CHS_Msk                    ((uint32_t)0x000001F0)
#define ADC1_CFG_REG_CHCH                       ((uint32_t)0x00000200)
#define ADC1_CFG_REG_RNGC                       ((uint32_t)0x00000400)
#define ADC1_CFG_M_REF                          ((uint32_t)0x00000800)
#define ADC1_CFG_REG_DIVCLK_Msk                 ((uint32_t)0x0000F000)
#define ADC1_CFG_SYNC_CONVER                    ((uint32_t)0x00010000)
#define ADC1_CFG_TS_EN                          ((uint32_t)0x00020000)
#define ADC1_CFG_TS_BUF_EN                      ((uint32_t)0x00040000)
#define ADC1_CFG_SEL_TS                         ((uint32_t)0x00080000)
#define ADC1_CFG_SEL_VREF                       ((uint32_t)0x00100000)
#define ADC1_CFG_RESERVED_Msk                   ((uint32_t)0x01E00000)
#define ADC1_CFG_DELAY_GO_Msk                   ((uint32_t)0x0E000000)
#define ADC1_CFG_DELAY_ADC_Msk                  ((uint32_t)0xF0000000)

/** @} */ /* End of group ADC1_CFG */


/** @defgroup __K1986VE1xI_Periph_ADC2_CFG	ADC2 CFG
  * @{
  */ 

/*-- ADC2_CFG: ADC2 Configuration Register -------------------------*/
/* Bit field positions: */
#define ADC2_CFG_ADC1_OP_Pos                   17

/* Bit field masks: */
#define ADC2_CFG_ADC1_OP                        ((uint32_t)0x00020000)

/** @} */ /* End of group ADC2_CFG */


/** @defgroup __K1986VE1xI_Periph_ADC1_RESULT	ADC1 RESULT
  * @{
  */ 

/*-- ADC1_RESULT: ADC1 Result Register -------------------------*/
#define ADC_RESULT_Pos                        0
#define ADC_RESULT_Msk                        ((uint32_t)0x00000FFF)

#define ADC_RESULT_CHANNEL_Pos                16
#define ADC_RESULT_CHANNEL_Msk                ((uint32_t)0x0FFF0000)

/** @} */ /* End of group ADC1_RESULT */


/** @defgroup __K1986VE1xI_Periph_ADC_STASUS	ADC STASUS
  * @{
  */ 

/*-- ADC_STASUS: ADC STASUS Register -----*/
/* Bit field positions: */
#define ADC_STATUS_FLG_REG_OVERWRITE_Pos      0
#define ADC_STATUS_FLG_REG_AWOIFEN_Pos        1
#define ADC_STATUS_FLG_REG_EOCIF_Pos          2
#define ADC_STATUS_AWOIF_IE_Pos               3
#define ADC_STATUS_ECOIF_IE_Pos               4

/* Bit field masks: */
#define ADC_STATUS_FLG_REG_OVERWRITE           ((uint32_t)0x00000001)
#define ADC_STATUS_FLG_REG_AWOIFEN             ((uint32_t)0x00000002)
#define ADC_STATUS_FLG_REG_EOCIF               ((uint32_t)0x00000004)
#define ADC_STATUS_AWOIF_IE                    ((uint32_t)0x00000008)
#define ADC_STATUS_ECOIF_IE                    ((uint32_t)0x00000010)

/** @} */ /* End of group ADC_STASUS */

/** @defgroup __K1986VE1xI_Periph_ADC_TRIM	ADC TRIM
  * @{
  */ 

/*-- ADC_TRIM: ADC TRIM Register -----*/
/* Bit field positions: */
#define ADC1_TRIM_TS_TRIM_Pos					1
#define ADC1_TRIM_SEL_VREF_BUF_Pos				6

/* Bit field masks: */
#define ADC1_TRIM_TS_TRIM_Msk             		((uint32_t)0x0000003E)
#define ADC1_TRIM_SEL_VREF_BUF					((uint32_t)0x00000040)

/** @} */ /* End of group ADC_TRIM */

/** @} */ /* End of group Periph_ADC_Defines */

