unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
/*-- ARINC429R_STATUS1: ARINC429R STATUS1 Register -----*/
/* Bit field positions: */
#define ARINC429R_STATUS1_DR1_Pos               0
#define ARINC429R_STATUS1_DR2_Pos               1
#define ARINC429R_STATUS1_DR3_Pos               2
#define ARINC429R_STATUS1_DR4_Pos               3
#define ARINC429R_STATUS1_DR5_Pos               4
#define ARINC429R_STATUS1_DR6_Pos               5
#define ARINC429R_STATUS1_DR7_Pos               6
#define ARINC429R_STATUS1_DR8_Pos               7
#define ARINC429R_STATUS1_ERR1_Pos              14
#define ARINC429R_STATUS1_ERR2_Pos              15
#define ARINC429R_STATUS1_ERR3_Pos              16
#define ARINC429R_STATUS1_ERR4_Pos              17
#define ARINC429R_STATUS1_ERR5_Pos              18
#define ARINC429R_STATUS1_ERR6_Pos              19
#define ARINC429R_STATUS1_ERR7_Pos              20
#define ARINC429R_STATUS1_ERR8_Pos              21

/* Bit field masks: */
#define ARINC429R_STATUS1_DR1                   ((uint32_t)0x00000001)
#define ARINC429R_STATUS1_DR2                   ((uint32_t)0x00000002)
#define ARINC429R_STATUS1_DR3                   ((uint32_t)0x00000004)
#define ARINC429R_STATUS1_DR4                   ((uint32_t)0x00000008)
#define ARINC429R_STATUS1_DR5                   ((uint32_t)0x00000010)
#define ARINC429R_STATUS1_DR6                   ((uint32_t)0x00000020)
#define ARINC429R_STATUS1_DR7                   ((uint32_t)0x00000040)
#define ARINC429R_STATUS1_DR8                   ((uint32_t)0x00000080)
#define ARINC429R_STATUS1_ERR1                  ((uint32_t)0x00004000)
#define ARINC429R_STATUS1_ERR2                  ((uint32_t)0x00008000)
#define ARINC429R_STATUS1_ERR3                  ((uint32_t)0x00010000)
#define ARINC429R_STATUS1_ERR4                  ((uint32_t)0x00020000)
#define ARINC429R_STATUS1_ERR5                  ((uint32_t)0x00040000)
#define ARINC429R_STATUS1_ERR6                  ((uint32_t)0x00080000)
#define ARINC429R_STATUS1_ERR7                  ((uint32_t)0x00100000)
#define ARINC429R_STATUS1_ERR8                  ((uint32_t)0x00200000)

/** @} */ /* End of group ARINC429R_STATUS1 */

/** @defgroup __K1986VE1xI_Periph_ARINC429R_STATUS2 ARINC429R STATUS2
  * @{
  */ 

/*-- ARINC429R_STATUS2: ARINC429R STATUS2 Register -----*/
/* Bit field positions: */
#define ARINC429R_STATUS2_FF1_Pos               0
#define ARINC429R_STATUS2_FF2_Pos               1
#define ARINC429R_STATUS2_FF3_Pos               2
#define ARINC429R_STATUS2_FF4_Pos               3
#define ARINC429R_STATUS2_FF5_Pos               4
#define ARINC429R_STATUS2_FF6_Pos               5
#define ARINC429R_STATUS2_FF7_Pos               6
#define ARINC429R_STATUS2_FF8_Pos               7
#define ARINC429R_STATUS2_HF1_Pos               14
#define ARINC429R_STATUS2_HF2_Pos               15
#define ARINC429R_STATUS2_HF3_Pos               16
#define ARINC429R_STATUS2_HF4_Pos               17
#define ARINC429R_STATUS2_HF5_Pos               18
#define ARINC429R_STATUS2_HF6_Pos               19
#define ARINC429R_STATUS2_HF7_Pos               20
#define ARINC429R_STATUS2_HF8_Pos               21

/* Bit field masks: */
#define ARINC429R_STATUS2_FF1                   ((uint32_t)0x00000001)
#define ARINC429R_STATUS2_FF2                   ((uint32_t)0x00000002)
#define ARINC429R_STATUS2_FF3                   ((uint32_t)0x00000004)
#define ARINC429R_STATUS2_FF4                   ((uint32_t)0x00000008)
#define ARINC429R_STATUS2_FF5                   ((uint32_t)0x00000010)
#define ARINC429R_STATUS2_FF6                   ((uint32_t)0x00000020)
#define ARINC429R_STATUS2_FF7                   ((uint32_t)0x00000040)
#define ARINC429R_STATUS2_FF8                   ((uint32_t)0x00000080)
#define ARINC429R_STATUS2_HF1                   ((uint32_t)0x00004000)
#define ARINC429R_STATUS2_HF2                   ((uint32_t)0x00008000)
#define ARINC429R_STATUS2_HF3                   ((uint32_t)0x00010000)
#define ARINC429R_STATUS2_HF4                   ((uint32_t)0x00020000)
#define ARINC429R_STATUS2_HF5                   ((uint32_t)0x00040000)
#define ARINC429R_STATUS2_HF6                   ((uint32_t)0x00080000)
#define ARINC429R_STATUS2_HF7                   ((uint32_t)0x00100000)
#define ARINC429R_STATUS2_HF8                   ((uint32_t)0x00200000)

/** @} */ /* End of group ARINC429R_STATUS2 */

/** @defgroup __K1986VE1xI_Periph_ARINC429R_CONTROL4 ARINC429R CONTROL4
  * @{
  */ 

/*-- ARINC429R_CONTROL4: ARINC429R CONTROL4 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL4_DIV_CH1_Pos               0
#define ARINC429R_CONTROL4_DIV_CH2_Pos               8
#define ARINC429R_CONTROL4_DIV_CH3_Pos               16
#define ARINC429R_CONTROL4_DIV_CH4_Pos               24

/* Bit field masks: */
#define ARINC429R_CONTROL4_DIV_CH1_Msk               ((uint32_t)0x000000FF)
#define ARINC429R_CONTROL4_DIV_CH2_Msk               ((uint32_t)0x0000FF00)
#define ARINC429R_CONTROL4_DIV_CH3_Msk               ((uint32_t)0x00FF0000)
#define ARINC429R_CONTROL4_DIV_CH4_Msk               ((uint32_t)0xFF000000)

/** @} */ /* End of group ARINC429R_CONTROL4 */

/** @defgroup __K1986VE1xI_Periph_ARINC429R_CONTROL5 ARINC429R CONTROL5
  * @{
  */ 

/*-- ARINC429R_CONTROL5: ARINC429R CONTROL5 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL5_DIV_CH5_Pos               0
#define ARINC429R_CONTROL5_DIV_CH6_Pos               8
#define ARINC429R_CONTROL5_DIV_CH7_Pos               16
#define ARINC429R_CONTROL5_DIV_CH8_Pos               24

/* Bit field masks: */
#define ARINC429R_CONTROL5_DIV_CH5_Msk               ((uint32_t)0x000000FF)
#define ARINC429R_CONTROL5_DIV_CH6_Msk               ((uint32_t)0x0000FF00)
#define ARINC429R_CONTROL5_DIV_CH7_Msk               ((uint32_t)0x00FF0000)
#define ARINC429R_CONTROL5_DIV_CH8_Msk               ((uint32_t)0xFF000000)

/** @} */ /* End of group ARINC429R_CONTROL5 */

/** @defgroup __K1986VE1xI_Periph_ARINC429R_CHANNEL ARINC429R CHANNEL
  * @{
  */ 

/*-- ARINC429R_CHANNEL: ARINC429R CHANNEL Register -----*/
/* Bit field positions: */
#define ARINC429R_CHANNEL_CHAN_Pos                  0

/* Bit field masks: */
#define ARINC429R_CHANNEL_CHAN_Msk                  ((uint32_t)0x0000000F)

/** @} */ /* End of group Periph_ARINC429R_CHANNEL */

