unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
/** @defgroup __K1986VE1xI_Periph_ARINC429R_INTMASK ARINC429R INTMASK
  * @{
  */ 

/*-- ARINC429R_INTMASK: ARINC429R INTMASK register -----*/
/* Bit field positions: */
#define ARINC429R_INTMASK_IEHF1_Pos                 0
#define ARINC429R_INTMASK_IEFF1_Pos                 1
#define ARINC429R_INTMASK_IEER1_Pos                 2
#define ARINC429R_INTMASK_IEDR1_Pos                 3
#define ARINC429R_INTMASK_IEHF2_Pos                 4
#define ARINC429R_INTMASK_IEFF2_Pos                 5
#define ARINC429R_INTMASK_IEER2_Pos                 6
#define ARINC429R_INTMASK_IEDR2_Pos                 7
#define ARINC429R_INTMASK_IEHF3_Pos                 8
#define ARINC429R_INTMASK_IEFF3_Pos                 9
#define ARINC429R_INTMASK_IEER3_Pos                 10
#define ARINC429R_INTMASK_IEDR3_Pos                 11
#define ARINC429R_INTMASK_IEHF4_Pos                 12
#define ARINC429R_INTMASK_IEFF4_Pos                 13
#define ARINC429R_INTMASK_IEER4_Pos                 14
#define ARINC429R_INTMASK_IEDR4_Pos                 15
#define ARINC429R_INTMASK_IEHF5_Pos                 16
#define ARINC429R_INTMASK_IEFF5_Pos                 17
#define ARINC429R_INTMASK_IEER5_Pos                 18
#define ARINC429R_INTMASK_IEDR5_Pos                 19
#define ARINC429R_INTMASK_IEHF6_Pos                 20
#define ARINC429R_INTMASK_IEFF6_Pos                 21
#define ARINC429R_INTMASK_IEER6_Pos                 22
#define ARINC429R_INTMASK_IEDR6_Pos                 23
#define ARINC429R_INTMASK_IEHF7_Pos                 24
#define ARINC429R_INTMASK_IEFF7_Pos                 25
#define ARINC429R_INTMASK_IEER7_Pos                 26
#define ARINC429R_INTMASK_IEDR7_Pos                 27
#define ARINC429R_INTMASK_IEHF8_Pos                 28
#define ARINC429R_INTMASK_IEFF8_Pos                 29
#define ARINC429R_INTMASK_IEER8_Pos                 30
#define ARINC429R_INTMASK_IEDR8_Pos                 31

/* Bit field masks: */
#define ARINC429R_INTMASK_IEHF1                     ((uint32_t)0x00000001))
#define ARINC429R_INTMASK_IEFF1                     ((uint32_t)0x00000002))
#define ARINC429R_INTMASK_IEER1                     ((uint32_t)0x00000004))
#define ARINC429R_INTMASK_IEDR1                     ((uint32_t)0x00000008))
#define ARINC429R_INTMASK_IEHF2                     ((uint32_t)0x00000010))
#define ARINC429R_INTMASK_IEFF2                     ((uint32_t)0x00000020))
#define ARINC429R_INTMASK_IEER2                     ((uint32_t)0x00000040))
#define ARINC429R_INTMASK_IEDR2                     ((uint32_t)0x00000080))
#define ARINC429R_INTMASK_IEHF3                     ((uint32_t)0x00000100))
#define ARINC429R_INTMASK_IEFF3                     ((uint32_t)0x00000200))
#define ARINC429R_INTMASK_IEER3                     ((uint32_t)0x00000400))
#define ARINC429R_INTMASK_IEDR3                     ((uint32_t)0x00000800))
#define ARINC429R_INTMASK_IEHF4                     ((uint32_t)0x00001000))
#define ARINC429R_INTMASK_IEFF4                     ((uint32_t)0x00002000))
#define ARINC429R_INTMASK_IEER4                     ((uint32_t)0x00004000))
#define ARINC429R_INTMASK_IEDR4                     ((uint32_t)0x00008000))
#define ARINC429R_INTMASK_IEHF5                     ((uint32_t)0x00010000))
#define ARINC429R_INTMASK_IEFF5                     ((uint32_t)0x00020000))
#define ARINC429R_INTMASK_IEER5                     ((uint32_t)0x00040000))
#define ARINC429R_INTMASK_IEDR5                     ((uint32_t)0x00080000))
#define ARINC429R_INTMASK_IEHF6                     ((uint32_t)0x00100000))
#define ARINC429R_INTMASK_IEFF6                     ((uint32_t)0x00200000))
#define ARINC429R_INTMASK_IEER6                     ((uint32_t)0x00400000))
#define ARINC429R_INTMASK_IEDR6                     ((uint32_t)0x00800000))
#define ARINC429R_INTMASK_IEHF7                     ((uint32_t)0x01000000))
#define ARINC429R_INTMASK_IEFF7                     ((uint32_t)0x02000000))
#define ARINC429R_INTMASK_IEER7                     ((uint32_t)0x04000000))
#define ARINC429R_INTMASK_IEDR7                     ((uint32_t)0x08000000))
#define ARINC429R_INTMASK_IEHF8                     ((uint32_t)0x10000000))
#define ARINC429R_INTMASK_IEFF8                     ((uint32_t)0x20000000))
#define ARINC429R_INTMASK_IEER8                     ((uint32_t)0x40000000))
#define ARINC429R_INTMASK_IEDR8                     ((uint32_t)0x80000000))

/** @} */ /* End of group ARINC429R_INTMASK */

/** @defgroup __K1986VE1xI_Periph_ARINC429R_CONTROL8 ARINC429R CONTROL8
  * @{
  */ 

#define ARINC429R_CONTROL8_ENPAR_Pos                0
#define ARINC429R_CONTROL8_ENPAR_Msk                (0xFFUL << ARINC429R_CONTROL8_ENPAR_Pos)

#define ARINC429R_CONTROL8_ODD_Pos                  14
#define ARINC429R_CONTROL8_ODD_Msk                  (0xFFUL << ARINC429R_CONTROL8_ODD_Pos)

#define ARINC429R_CONTROL8_DA0_Pos                  28
#define ARINC429R_CONTROL8_DA0_Msk                  (0x1UL << ARINC429R_CONTROL8_DA0_Pos)
#define ARINC429R_CONTROL8_DA0                      ARINC429R_CONTROL8_DA0_Msk

#define ARINC429R_CONTROL8_DA1_Pos                  29
#define ARINC429R_CONTROL8_DA1_Msk                  (0x1UL << ARINC429R_CONTROL8_DA1_Pos)
#define ARINC429R_CONTROL8_DA1                      ARINC429R_CONTROL8_DA1_Msk

/** @} */ /* End of group ARINC429R_CONTROL8 */

/** @defgroup __K1986VE1xI_Periph_ARINC429R_CONTROL9 ARINC429R CONTROL9
  * @{
  */ 

#define ARINC429R_CONTROL9_ENSYNC_Pos               0
#define ARINC429R_CONTROL9_ENSYNC_Msk               (0xFFUL << ARINC429R_CONTROL9_ENSYNC_Pos)

/** @} */ /* End of group ARINC429R_CONTROL9 */

/** @defgroup __K1986VE1xI_Periph_ARINC429R_CONTROL10 ARINC429R CONTROL10
  * @{
  */ 

#define ARINC429R_CONTROL10_R_PAUSE1_Pos            0
#define ARINC429R_CONTROL10_R_PAUSE1_Msk            (0xFFUL << ARINC429R_CONTROL10_R_PAUSE1_Pos)

#define ARINC429R_CONTROL10_R_PAUSE2_Pos            8
#define ARINC429R_CONTROL10_R_PAUSE2_Msk            (0xFFUL << ARINC429R_CONTROL10_R_PAUSE2_Pos)

#define ARINC429R_CONTROL10_R_PAUSE3_Pos            16
#define ARINC429R_CONTROL10_R_PAUSE3_Msk            (0xFFUL << ARINC429R_CONTROL10_R_PAUSE3_Pos)

#define ARINC429R_CONTROL10_R_PAUSE4_Pos            24
#define ARINC429R_CONTROL10_R_PAUSE4_Msk            (0xFFUL << ARINC429R_CONTROL10_R_PAUSE4_Pos)

