unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
/** @} */ /* End of group ARINC429R_CONTROL10 */

/** @defgroup __K1986VE1xI_Periph_ARINC429R_CONTROL11 ARINC429R CONTROL11
  * @{
  */ 

#define ARINC429R_CONTROL11_R_PAUSE5_Pos            0
#define ARINC429R_CONTROL11_R_PAUSE5_Msk            (0xFFUL << ARINC429R_CONTROL11_R_PAUSE5_Pos)

#define ARINC429R_CONTROL11_R_PAUSE6_Pos            8
#define ARINC429R_CONTROL11_R_PAUSE6_Msk            (0xFFUL << ARINC429R_CONTROL11_R_PAUSE6_Pos)

#define ARINC429R_CONTROL11_R_PAUSE7_Pos            16
#define ARINC429R_CONTROL11_R_PAUSE7_Msk            (0xFFUL << ARINC429R_CONTROL11_R_PAUSE7_Pos)

#define ARINC429R_CONTROL11_R_PAUSE8_Pos            24
#define ARINC429R_CONTROL11_R_PAUSE8_Msk            (0xFFUL << ARINC429R_CONTROL11_R_PAUSE8_Pos)

/** @} */ /* End of group ARINC429R_CONTROL11 */

/** @} */ /* End of group __K1986VE1xI_Periph_ARINC429R_Defines */

/** @} */ /* End of group __K1986VE1xI_Periph_ARINC429R */

/** @defgroup K1986VE1xI_Periph_ARINC429T ARINC429T
  * @{
  */

/** @defgroup K1986VE1xI_Periph_ARINC429T_Data_Structures Data Structures
  * @{
  */

/* MDR_ARINC429T_TypeDef structure */
typedef struct
{
	__IO uint32_t CONTROL1;
	__IO uint32_t CONTROL2;
	__IO uint32_t STATUS;
	__IO uint32_t DATA1_T;
	__IO uint32_t DATA2_T;
	__IO uint32_t DATA3_T;
	__IO uint32_t DATA4_T;
	__IO uint32_t CONTROL3;
	__IO uint32_t CONTROL4;
	__IO uint32_t CONTROL5;
}MDR_ARINC429T_TypeDef;

/** @} */ /* End of group Periph_ARINC429T_Data_Structures */

/** @defgroup K1986VE1xI_Periph_ARINC429T_Defines Defines
  * @{
  */

/** @defgroup __K1986VE1xI_Periph_ARINC429T_CONTROL1 ARINC429T CONTROL1
  * @{
  */ 

/*-- ARINC429T_CONTROL1: ARINC429T CONTROL1 Register -----*/
/* Bit field positions: */
#define ARINC429T_CONTROL1_CH_EN1_Pos               0
#define ARINC429T_CONTROL1_CLK1_Pos                 1
#define ARINC429T_CONTROL1_EN_PAR1_Pos              2
#define ARINC429T_CONTROL1_ODD1_Pos                 3
#define ARINC429T_CONTROL1_CH_EN2_Pos               4
#define ARINC429T_CONTROL1_CLK2_Pos                 5
#define ARINC429T_CONTROL1_EN_PAR2_Pos              6
#define ARINC429T_CONTROL1_ODD2_Pos                 7
#define ARINC429T_CONTROL1_DIV_Pos                  8
#define ARINC429T_CONTROL1_INTE_FFT1_Pos            15
#define ARINC429T_CONTROL1_INTE_TXR1_Pos            16
#define ARINC429T_CONTROL1_INTE_HFT1_Pos            17
#define ARINC429T_CONTROL1_INTE_FFT2_Pos            18
#define ARINC429T_CONTROL1_INTE_TXR2_Pos            19
#define ARINC429T_CONTROL1_INTE_HFT2_Pos            20

/* Bit field masks: */
#define ARINC429T_CONTROL1_CH_EN1                   ((uint32_t)0x00000001)
#define ARINC429T_CONTROL1_CLK1                     ((uint32_t)0x00000002)
#define ARINC429T_CONTROL1_EN_PAR1                  ((uint32_t)0x00000004)
#define ARINC429T_CONTROL1_ODD1                     ((uint32_t)0x00000008)
#define ARINC429T_CONTROL1_CH_EN2                   ((uint32_t)0x00000010)
#define ARINC429T_CONTROL1_CLK2                     ((uint32_t)0x00000020)
#define ARINC429T_CONTROL1_EN_PAR2                  ((uint32_t)0x00000040)
#define ARINC429T_CONTROL1_ODD2                     ((uint32_t)0x00000080)
#define ARINC429T_CONTROL1_DIV_MASK                 ((uint32_t)0x00007F00)
#define ARINC429T_CONTROL1_INTE_FFT1                ((uint32_t)0x00008000)
#define ARINC429T_CONTROL1_INTE_TXR1                ((uint32_t)0x00010000)
#define ARINC429T_CONTROL1_INTE_HFT1                ((uint32_t)0x00020000)
#define ARINC429T_CONTROL1_INTE_FFT2                ((uint32_t)0x00040000)
#define ARINC429T_CONTROL1_INTE_TXR2                ((uint32_t)0x00080000)
#define ARINC429T_CONTROL1_INTE_HFT2                ((uint32_t)0x00100000)

/** @} */ /* End of group ARINC429T_CONTROL1 */

/** @defgroup __K1986VE1xI_Periph_ARINC429T_CONTROL2 ARINC429T CONTROL2
  * @{
  */ 

/*-- ARINC429T_CONTROL2: ARINC429T CONTROL2 Register -----*/
/* Bit field positions: */
#define ARINC429T_CONTROL2_CH_EN3_Pos               0
#define ARINC429T_CONTROL2_CLK3_Pos                 1
#define ARINC429T_CONTROL2_EN_PAR3_Pos              2
#define ARINC429T_CONTROL2_ODD3_Pos                 3
#define ARINC429T_CONTROL2_CH_EN4_Pos               4
#define ARINC429T_CONTROL2_CLK4_Pos                 5
#define ARINC429T_CONTROL2_EN_PAR4_Pos              6
#define ARINC429T_CONTROL2_ODD4_Pos                 7
#define ARINC429T_CONTROL2_INTE_FFT3_Pos            15
#define ARINC429T_CONTROL2_INTE_TXR3_Pos            16
#define ARINC429T_CONTROL2_INTE_HFT3_Pos            17
#define ARINC429T_CONTROL2_INTE_FFT4_Pos            18
#define ARINC429T_CONTROL2_INTE_TXR4_Pos            19
#define ARINC429T_CONTROL2_INTE_HFT4_Pos            20

/* Bit field masks: */
#define ARINC429T_CONTROL2_CH_EN3                   ((uint32_t)0x00000001)
#define ARINC429T_CONTROL2_CLK3                     ((uint32_t)0x00000002)
#define ARINC429T_CONTROL2_EN_PAR3                  ((uint32_t)0x00000004)
#define ARINC429T_CONTROL2_ODD3                     ((uint32_t)0x00000008)
#define ARINC429T_CONTROL2_CH_EN4                   ((uint32_t)0x00000010)
#define ARINC429T_CONTROL2_CLK4                     ((uint32_t)0x00000020)
#define ARINC429T_CONTROL2_EN_PAR4                  ((uint32_t)0x00000040)
#define ARINC429T_CONTROL2_ODD4                     ((uint32_t)0x00000080)
#define ARINC429T_CONTROL2_INTE_FFT3                ((uint32_t)0x00008000)
#define ARINC429T_CONTROL2_INTE_TXR3                ((uint32_t)0x00010000)
#define ARINC429T_CONTROL2_INTE_HFT3                ((uint32_t)0x00020000)
#define ARINC429T_CONTROL2_INTE_FFT4                ((uint32_t)0x00040000)
#define ARINC429T_CONTROL2_INTE_TXR4                ((uint32_t)0x00080000)
#define ARINC429T_CONTROL2_INTE_HFT4                ((uint32_t)0x00100000)

/** @} */ /* End of group ARINC429T_CONTROL2 */

/** @defgroup __K1986VE1xI_Periph_ARINC429T_STATUS ARINC429T STATUS
  * @{
  */ 

/*-- ARINC429T_STATUS: ARINC429T STATUS Register -----*/
/* Bit field positions: */
#define ARINC429T_STATUS_TX_R1_Pos                  0
#define ARINC429T_STATUS_FFT1_Pos                   1
#define ARINC429T_STATUS_HFT1_Pos                   2
#define ARINC429T_STATUS_TX_R2_Pos                  3
#define ARINC429T_STATUS_FFT2_Pos                   4
#define ARINC429T_STATUS_HFT2_Pos                   5
#define ARINC429T_STATUS_TX_R3_Pos                  8
#define ARINC429T_STATUS_FFT3_Pos                   9
#define ARINC429T_STATUS_HFT3_Pos                   10
#define ARINC429T_STATUS_TX_R4_Pos                  11
#define ARINC429T_STATUS_FFT4_Pos                   12
#define ARINC429T_STATUS_HFT4_Pos                   13

/* Bit field masks: */
#define ARINC429T_STATUS_TX_R1                      ((uint32_t)0x00000001)
#define ARINC429T_STATUS_FFT1                       ((uint32_t)0x00000002)
#define ARINC429T_STATUS_HFT1                       ((uint32_t)0x00000004)
#define ARINC429T_STATUS_TX_R2                      ((uint32_t)0x00000008)
#define ARINC429T_STATUS_FFT2                       ((uint32_t)0x00000010)
#define ARINC429T_STATUS_HFT2                       ((uint32_t)0x00000020)
#define ARINC429T_STATUS_TX_R3                      ((uint32_t)0x00000100)
#define ARINC429T_STATUS_FFT3                       ((uint32_t)0x00000200)
#define ARINC429T_STATUS_HFT3                       ((uint32_t)0x00000400)
#define ARINC429T_STATUS_TX_R4                      ((uint32_t)0x00000800)
#define ARINC429T_STATUS_FFT4                       ((uint32_t)0x00001000)
#define ARINC429T_STATUS_HFT4                       ((uint32_t)0x00002000)

/** @} */ /* End of group ARINC429T_STATUS */

