unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
/** @defgroup __K1986VE1xI_Periph_ARINC429T_CONTROL3 ARINC429T CONTROL3
  * @{
  */ 

/*-- ARINC429T_CONTROL3: ARINC429T CONTROL3 Register -----*/
/* Bit field positions: */
#define ARINC429T_CONTROL3_DIV_CH1_Pos               0
#define ARINC429T_CONTROL3_DIV_CH2_Pos               8
#define ARINC429T_CONTROL3_DIV_CH3_Pos               16
#define ARINC429T_CONTROL3_DIV_CH4_Pos               24

/* Bit field masks: */
#define ARINC429T_CONTROL3_DIV_CH1_Msk               ((uint32_t)0x000000FF)
#define ARINC429T_CONTROL3_DIV_CH2_Msk               ((uint32_t)0x0000FF00)
#define ARINC429T_CONTROL3_DIV_CH3_Msk               ((uint32_t)0x00FF0000)
#define ARINC429T_CONTROL3_DIV_CH4_Msk               ((uint32_t)0xFF000000)

/** @} */ /* End of group ARINC429T_CONTROL3 */

/** @defgroup __K1986VE1xI_Periph_ARINC429T_CONTROL4 ARINC429T CONTROL4
  * @{
  */ 

#define ARINC429T_CONTROL4_ENSYNC_Pos               0
#define ARINC429T_CONTROL4_ENSYNC_Msk               (0xFFUL << ARINC429T_CONTROL4_ENSYNC_Pos)

/** @} */ /* End of group Periph_ARINC429T_CONTROL4 */

/** @defgroup __K1986VE1xI_Periph_ARINC429T_CONTROL5 ARINC429T CONTROL5
  * @{
  */ 

#define ARINC429T_CONTROL5_T_PAUSE1_Pos             0
#define ARINC429T_CONTROL5_T_PAUSE1_Msk             (0xFFUL << ARINC429T_CONTROL5_T_PAUSE1_Pos)

#define ARINC429T_CONTROL5_T_PAUSE2_Pos             8
#define ARINC429T_CONTROL5_T_PAUSE2_Msk             (0xFFUL << ARINC429T_CONTROL5_T_PAUSE2_Pos)

#define ARINC429T_CONTROL5_T_PAUSE3_Pos             16
#define ARINC429T_CONTROL5_T_PAUSE3_Msk             (0xFFUL << ARINC429T_CONTROL5_T_PAUSE3_Pos)

#define ARINC429T_CONTROL5_T_PAUSE4_Pos             24
#define ARINC429T_CONTROL5_T_PAUSE4_Msk             (0xFFUL << ARINC429T_CONTROL5_T_PAUSE4_Pos)

/** @} */ /* End of group Periph_ARINC429T_CONTROL5 */

/** @} */ /* End of group __K1986VE1xI_Periph_ARINC429T_Defines */

/** @} */ /* End of group __K1986VE1xI_Periph_ARINC429T */

/** @defgroup K1986VE1xI_Periph_BKP BKP
  * @{
  */

/** @defgroup K1986VE1xI_Periph_BKP_Data_Structures Data Structures
  * @{
  */

/* MDR_BKP_TypeDef structure */
typedef struct
{
  __IO uint32_t REG_00;
  __IO uint32_t REG_01;
  __IO uint32_t REG_02;
  __IO uint32_t REG_03;
  __IO uint32_t REG_04;
  __IO uint32_t REG_05;
  __IO uint32_t REG_06;
  __IO uint32_t REG_07;
  __IO uint32_t REG_08;
  __IO uint32_t REG_09;
  __IO uint32_t REG_0A;
  __IO uint32_t REG_0B;
  __IO uint32_t REG_0C;
  __IO uint32_t REG_0D;
  __IO uint32_t REG_0E;
  __IO uint32_t REG_0F;
  __IO uint32_t RTC_CNT;
  __IO uint32_t RTC_DIV;
  __IO uint32_t RTC_PRL;
  __IO uint32_t RTC_ALRM;
  __IO uint32_t RTC_CS;
}MDR_BKP_TypeDef;

/** @} */ /* End of group __K1986VE1xI_Periph_BKP_Data_Structures */

/** @defgroup K1986VE1xI_Periph_BKP_Defines Defines
  * @{
  */

/** @defgroup __K1986VE1xI_Periph_BKP_REG_0E	BKP REG 0E
  * @{
  */ 

/*-- BKP_REG_0E: Backup Register 14 --------------------------------*/
/* Bit field positions: */
#define BKP_REG_0E_LOW_Pos                      0
#define BKP_REG_0E_SELECTRI_Pos                 3
#define BKP_REG_0E_SANDALONE_Pos                6
#define BKP_REG_0E_TRIM_02_Pos                  8
#define BKP_REG_0E_FPOR_Pos                     11
#define BKP_REG_0E_TRIM_34_Pos                  12
#define BKP_REG_0E_ILIMEN_Pos                   15

/* Bit field masks: */
#define BKP_REG_0E_LOW_Msk                      ((uint32_t)0x00000007)
#define BKP_REG_0E_SELECTRI_Msk                 ((uint32_t)0x00000038)
#define BKP_REG_0E_SANDALONE                    ((uint32_t)0x00000040)
#define BKP_REG_0E_TRIM_02_Msk                  ((uint32_t)0x00000700)
#define BKP_REG_0E_TRIM_34_Msk                  ((uint32_t)0x00003000)
#define BKP_REG_0E_TRIM_Msk                     ((uint32_t)0x00003700)
#define BKP_REG_0E_FPOR                         ((uint32_t)0x00000800)
#define BKP_REG_0E_ILIMEN                       ((uint32_t)0x00008000)

/** @} */ /* End of group BKP_REG_0E */

/** @defgroup __K1986VE1xI_Periph_BKP_REG_0F	BKP REG 0F
  * @{
  */ 

/*-- BKP_REG_0F: Backup Register 15 --------------------------------*/
/* Bit field positions: */
#define BKP_REG_0F_LSE_ON_Pos                   0
#define BKP_REG_0F_LSE_BYP_Pos                  1
#define BKP_REG_0F_RTC_SEL_Pos                  2
#define BKP_REG_0F_RTC_EN_Pos                   4
#define BKP_REG_0F_CAL_Pos                      5
#define BKP_REG_0F_LSE_RDY_Pos                  13
#define BKP_REG_0F_BKP_REG_Pos                  14
#define BKP_REG_0F_LSI_ON_Pos                   15
#define BKP_REG_0F_LSI_TRIM_Pos                 16
#define BKP_REG_0F_LSI_RDY_Pos                  21
#define BKP_REG_0F_HSI_ON_Pos                   22
#define BKP_REG_0F_HSI_RDY_Pos                  23
#define BKP_REG_0F_HSI_TRIM_Pos                 24
#define BKP_REG_0F_STANDBY_Pos                  30
#define BKP_REG_0F_RTC_RESET_Pos                31

/* Bit field masks: */
#define BKP_REG_0F_LSE_ON                       ((uint32_t)0x00000001)
#define BKP_REG_0F_LSE_BYP                      ((uint32_t)0x00000002)
#define BKP_REG_0F_RTC_SEL_Msk                  ((uint32_t)0x0000000C)
#define BKP_REG_0F_RTC_EN                       ((uint32_t)0x00000010)
#define BKP_REG_0F_CAL_Msk                      ((uint32_t)0x00001FE0)
#define BKP_REG_0F_LSE_RDY                      ((uint32_t)0x00002000)
#define BKP_REG_0F_BKP_REG                      ((uint32_t)0x00004000)
#define BKP_REG_0F_LSI_ON                       ((uint32_t)0x00008000)
#define BKP_REG_0F_LSI_TRIM_Msk                 ((uint32_t)0x001F0000)
#define BKP_REG_0F_LSI_RDY                      ((uint32_t)0x00200000)
#define BKP_REG_0F_HSI_ON                       ((uint32_t)0x00400000)
#define BKP_REG_0F_HSI_RDY                      ((uint32_t)0x00800000)
#define BKP_REG_0F_HSI_TRIM_Msk                 ((uint32_t)0x3F000000)
#define BKP_REG_0F_STANDBY                      ((uint32_t)0x40000000)
#define BKP_REG_0F_RTC_RESET                    ((uint32_t)0x80000000)

/** @} */ /* End of group BKP_REG_0F */

