unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
/** @defgroup __K1986VE1xI_Periph_BKP_RTC_CS	BKP RTC CS
  * @{
  */ 

/*-- BKP_RTC_CS: Backup Realtime clock Register --------------------*/
/* Bit field positions: */
#define BKP_RTC_CS_OWF_Pos                      0
#define BKP_RTC_CS_SECF_Pos                     1
#define BKP_RTC_CS_ALRF_Pos                     2
#define BKP_RTC_CS_OWF_IE_Pos                   3
#define BKP_RTC_CS_SECF_IE_Pos                  4
#define BKP_RTC_CS_ALRF_IE_Pos                  5
#define BKP_RTC_CS_WEC_Pos                      6

/* Bit field masks: */
#define BKP_RTC_CS_OWF                          ((uint32_t)0x00000001)
#define BKP_RTC_CS_SECF                         ((uint32_t)0x00000002)
#define BKP_RTC_CS_ALRF                         ((uint32_t)0x00000004)
#define BKP_RTC_CS_Msk                          ((uint32_t)0x00000007)
#define BKP_RTC_CS_OWF_IE                       ((uint32_t)0x00000008)
#define BKP_RTC_CS_SECF_IE                      ((uint32_t)0x00000010)
#define BKP_RTC_CS_ALRF_IE                      ((uint32_t)0x00000020)
#define BKP_RTC_CS_WEC                          ((uint32_t)0x00000040)

/** @} */ /* End of group BKP_RTC_CS */

/** @} */ /* End of group __K1986VE1xI_Periph_BKP_Defines */

/** @} */ /* End of group __K1986VE1xI_Periph_BKP */

/** @defgroup K1986VE1xI_Periph_EBC EBC
 *  @{
 */

/** @defgroup K1986VE1xI_Periph_EBC_Data_structures Data Structures
 *  @{
 */

/* MDR_EBC_TypeDef structure */
typedef struct
{
       uint32_t RESERVED0[20];
  __IO uint32_t NAND_CYCLES;
  __IO uint32_t CONTROL;
  __IO uint32_t MEM_REGION[4];
}MDR_EBC_TypeDef;

/** @} */ /* End of groupe K1986VE1xI_Periph_EBC_Data_structures Data Structures */

/** @defgroup __K1986VE1xI_K1986VE1xI_Periph_EBC_Defines Defines
  * @{
  */

/** @defgroup __K1986VE1xI_Periph_EBC_NAND_CYCLES	EBC NAND CYCLES
  * @{
  */ 

/*-- EBC_NAND_CYCLES: EBC NAND Timing Register ---------------------*/
/* Bit field positions: */
#define EBC_NAND_CYCLES_TRC_Pos                 0
#define EBC_NAND_CYCLES_TWC_Pos                 4
#define EBC_NAND_CYCLES_TREA_Pos                8
#define EBC_NAND_CYCLES_TWP_Pos                 12
#define EBC_NAND_CYCLES_TWHR_Pos                16
#define EBC_NAND_CYCLES_TALEA_Pos               20
#define EBC_NAND_CYCLES_TRR_Pos                 24

/* Bit field masks: */
#define EBC_NAND_CYCLES_TRC_Msk                 ((uint32_t)0x0000000F)
#define EBC_NAND_CYCLES_TWC_Msk                 ((uint32_t)0x000000F0)
#define EBC_NAND_CYCLES_TREA_Msk                ((uint32_t)0x00000F00)
#define EBC_NAND_CYCLES_TWP_Msk                 ((uint32_t)0x0000F000)
#define EBC_NAND_CYCLES_TWHR_Msk                ((uint32_t)0x000F0000)
#define EBC_NAND_CYCLES_TALEA_Msk               ((uint32_t)0x00F00000)
#define EBC_NAND_CYCLES_TRR_Msk                 ((uint32_t)0x0F000000)

/** @} */ /* End of group EBC_NAND_CYCLES */


/** @defgroup __K1986VE1xI_Periph_EBC_CONTROL	EBC CONTROL
  * @{
  */ 

/*-- EBC_CONTROL: EBC Control Register -----------------------------*/
/* Bit field positions: */
#define EBC_CONTROL_ROM_Pos                     0
#define EBC_CONTROL_RAM_Pos                     1
#define EBC_CONTROL_NAND_Pos                    2
#define EBC_CONTROL_CPOL_Pos                    3
#define EBC_CONTROL_LOW8_Pos					5
#define EBC_CONTROL_LOW16_Pos					6
#define EBC_CONTROL_BUSY_Pos                    7
#define EBC_CONTROL_WAIT_STATE_Pos              12

/* Bit field masks: */
#define EBC_CONTROL_ROM                         ((uint32_t)0x00000001)
#define EBC_CONTROL_RAM                         ((uint32_t)0x00000002)
#define EBC_CONTROL_NAND                        ((uint32_t)0x00000004)
#define EBC_CONTROL_CPOL                        ((uint32_t)0x00000008)
#define EBC_CONTROL_LOW8						((uint32_t)0x00000020)
#define EBC_CONTROL_LOW16						((uint32_t)0x00000040)
#define EBC_CONTROL_BUSY                        ((uint32_t)0x00000080)
#define EBC_CONTROL_WAIT_STATE_Msk              ((uint32_t)0x0000F000)

/** @} */ /* End of group EBC_CONTROL */


/** @defgroup __K1986VE1xI_Periph_EBC_RAM_CYCLESx	EBC RAM CYCLESx
  * @{
  */ 

/*-- EBC_RAM_CYCLESx: Register customization options exchange with RAM -------*/
/* Bit field positions: */
#define EBC_RAM_CYCLES_ENABLE_TUNE_Pos			0
#define EBC_RAM_CYCLES_WS_ACTIVE_Pos			1
#define EBC_RAM_CYCLES_WS_SETUP_Pos				8
#define EBC_RAM_CYCLES_WS_HOLD_Pos				11
#define EBC_RAM_CYCLES_USE_READY_Pos			14

/* Bit field masks: */
#define EBC_RAM_CYCLES_ENABLE_TUNE				((uint32_t)0x00000001)
#define EBC_RAM_CYCLES_WS_ACTIVE_Msk			((uint32_t)0x000000FE)
#define EBC_RAM_CYCLES_WS_SETUP_Msk				((uint32_t)0x00000700)
#define EBC_RAM_CYCLES_WS_HOLD_Msk				((uint32_t)0x00003800)
#define EBC_RAM_CYCLES_USE_READY				((uint32_t)0x00004000)

/** @} */ /* End of group EBC_RAM_CYCLESx */

/** @} */ /* End of groupe K1986VE1xI_Periph_EBC_Defines Defines */

/** @} */ /* End of groupe __K1986VE1xI_Periph_EBC EBC */

/** @defgroup K1986VE1xI_Periph_ETHERNET ETHERNET
  * @{
  */

/** @defgroup K1986VE1xI_Periph_Data_Structures Data Structures
  * @{
  */

typedef struct {
  __IO uint16_t ETH_Dilimiter;		//0
  __IO uint16_t ETH_MAC_T;			//2
  __IO uint16_t ETH_MAC_M;			//4
  __IO uint16_t ETH_MAC_H;			//6
  __IO uint16_t ETH_HASH0;			//8
  __IO uint16_t ETH_HASH1;			//A
  __IO uint16_t ETH_HASH2;			//C
  __IO uint16_t ETH_HASH3;			//E
  __IO uint16_t ETH_IPG;			//10
  __IO uint16_t ETH_PSC;			//12
  __IO uint16_t ETH_BAG;			//14
  __IO uint16_t ETH_JitterWnd;		//16
  __IO uint16_t ETH_R_CFG;			//18
  __IO uint16_t ETH_X_CFG;			//1A
  __IO uint16_t ETH_G_CFGl;			//1C
  __IO uint16_t ETH_G_CFGh;			//1E
  __IO uint16_t ETH_IMR;			//20
  __IO uint16_t ETH_IFR;			//22
  __IO uint16_t ETH_MDIO_CTRL;		//24
  __IO uint16_t ETH_MDIO_DATA;		//26
  __IO uint16_t ETH_R_Head;			//28
  __IO uint16_t ETH_X_Tail;			//2A
  __IO uint16_t ETH_R_Tail;			//2C
  __IO uint16_t ETH_X_Head;			//2E
  __IO uint16_t ETH_STAT;			//30
  __IO uint16_t Reserved;			//32
  __IO uint16_t PHY_Control;		//34
  __IO uint16_t PHY_Status;			//36
} MDR_ETHERNET_TypeDef;

/** @} */ /* End of group __K1986VE1xI_Periph_Data_Structures */

/** @defgroup K1986VE1xI_Periph_ETHERNET_Defines Defines
  * @{
  */

/** @defgroup __K1986VE1xI_Periph_ETH_G_CFGl	ETH G CFGl
  * @{
  */ 

/*-- ETH_G_CFGl: ETH G_CFGl Register -----*/
/* Bit field positions: */
#define ETH_G_CFGl_ColWnd_Pos          		0
#define ETH_G_CFGl_PAUSE_EN_Pos       		8
#define ETH_G_CFGl_DTRM_EN_Pos         		9
#define ETH_G_CFGl_HD_EN_Pos          		10
#define ETH_G_CFGl_EXT_EN_Pos          		11
#define ETH_G_CFGl_BUFF_MODE_Pos       		12
#define ETH_G_CFGl_RCLR_EN_Pos         		14

/* Bit field masks: */
#define ETH_G_CFGl_ColWnd_Msk           	((uint32_t)0x000000FF)
#define ETH_G_CFGl_PAUSE_EN             	((uint32_t)0x00000100)
#define ETH_G_CFGl_DTRM_EN              	((uint32_t)0x00000200)
#define ETH_G_CFGl_HD_EN 	         	 	((uint32_t)0x00000400)
#define ETH_G_CFGl_EXT_EN               	((uint32_t)0x00000800)
#define ETH_G_CFGl_BUFF_MODE_Msk        	((uint32_t)0x00003000)
#define ETH_G_CFGl_RCLR_EN             	 	((uint32_t)0x00004000)

