unsi9ned/Milandr.MDR32FxQI_DFP/Libraries/CMSIS/MDR32FxQI/DeviceSupport/K1986VE1xI/inc/K1986VE1xI.h
/** @} */ /* End of group ETH_IFR */

/** @defgroup __K1986VE1xI_Periph_ETH_STAT	ETH STAT
  * @{
  */ 

/*-- ETH_STAT: ETH STAT Register -----*/
/* Bit field positions: */
#define ETH_STAT_R_EMPTY_Pos			0
#define ETH_STAT_R_AEMPTY_Pos			1
#define ETH_STAT_R_HALF_Pos				2
#define ETH_STAT_R_AFULL_Pos			3
#define ETH_STAT_R_FULL_Pos				4
#define ETH_STAT_R_COUNT_Pos			5
#define ETH_STAT_X_EMPTY_Pos			8
#define ETH_STAT_X_AEMPTY_Pos			9
#define ETH_STAT_X_HALF_Pos				10
#define ETH_STAT_X_AFULL_Pos			11
#define ETH_STAT_X_FULL_Pos				12

/* Bit field masks: */
#define ETH_STAT_R_EMPTY				((uint32_t)0x00000001)
#define ETH_STAT_R_AEMPTY				((uint32_t)0x00000002)
#define ETH_STAT_R_HALF					((uint32_t)0x00000004)
#define ETH_STAT_R_AFULL				((uint32_t)0x00000008)
#define ETH_STAT_R_FULL					((uint32_t)0x00000010)
#define ETH_STAT_R_COUNT_Msk			((uint32_t)0x000000E0)
#define ETH_STAT_X_EMPTY				((uint32_t)0x00000100)
#define ETH_STAT_X_AEMPTY				((uint32_t)0x00000200)
#define ETH_STAT_X_HALF					((uint32_t)0x00000400)
#define ETH_STAT_X_AFULL				((uint32_t)0x00000800)
#define ETH_STAT_X_FULL					((uint32_t)0x00001000)

/** @} */ /* End of group ETH_STAT */

/** @defgroup __K1986VE1xI_Periph_ETH_MDIO_CTRL	ETH MDIO CTRL
  * @{
  */ 

/*-- ETH_MDIO_CTRL: ETH MDIO_CTRL Register -----*/
/* Bit field positions: */
#define ETH_MDIO_CTRL_RG_A_Pos			0
#define ETH_MDIO_CTRL_DIV_Pos			5
#define ETH_MDIO_CTRL_PHY_A_Pos			8
#define ETH_MDIO_CTRL_OP_Pos			13
#define ETH_MDIO_CTRL_PRE_EN_Pos		14
#define ETH_MDIO_CTRL_RDY_Pos			15

/* Bit field masks: */
#define ETH_MDIO_CTRL_RG_A_Msk			((uint32_t)0x0000001F)
#define ETH_MDIO_CTRL_DIV_Msk			((uint32_t)0x000000E0)
#define ETH_MDIO_CTRL_PHY_A_Msk			((uint32_t)0x00001F00)
#define ETH_MDIO_CTRL_OP				((uint32_t)0x00002000)
#define ETH_MDIO_CTRL_PRE_EN			((uint32_t)0x00004000)
#define ETH_MDIO_CTRL_RDY				((uint32_t)0x00008000)

/** @} */ /* End of group ETH_MDIO_CTRL */

/** @defgroup __K1986VE1xI_Periph_ETH_PHY_CONTROL	ETH PHY CONTROL
  * @{
  */ 

/*-- ETH_PHY_CONTROL: ETH PHY_CONTROL Register -----*/
/* Bit field positions: */
#define ETH_PHY_CONTROL_nRST_Pos		0
#define ETH_PHY_CONTROL_MODE_Pos		1
#define ETH_PHY_CONTROL_FX_EN_Pos		7
#define ETH_PHY_CONTROL_MDI_Pos			8
#define ETH_PHY_CONTROL_MDIO_SEL_Pos	9
#define ETH_PHY_CONTROL_MDC_Pos			10
#define ETH_PHY_CONTROL_PHYADD_Pos		11

/* Bit field masks: */
#define ETH_PHY_CONTROL_nRST			((uint32_t)0x00000001)
#define ETH_PHY_CONTROL_MODE_Msk		((uint32_t)0x0000000E)
#define ETH_PHY_CONTROL_FX_EN			((uint32_t)0x00000080)
#define ETH_PHY_CONTROL_MDI				((uint32_t)0x00000100)
#define ETH_PHY_CONTROL_MDIO_SEL		((uint32_t)0x00000200)
#define ETH_PHY_CONTROL_MDC				((uint32_t)0x00000400)
#define ETH_PHY_CONTROL_PHYADD_Msk		((uint32_t)0x0000F800)

/** @} */ /* End of group ETH_PHY_CONTROL */

/** @defgroup __K1986VE1xI_Periph_ETH_PHY_STATUS	ETH PHY STATUS
  * @{
  */ 

/*-- ETH_PHY_STATUS: ETH PHY_STATUS Register -----*/
/* Bit field positions: */
#define ETH_PHY_STATUS_LED0_Pos			0
#define ETH_PHY_STATUS_LED1_Pos			1
#define ETH_PHY_STATUS_LED2_Pos			2
#define ETH_PHY_STATUS_LED3_Pos			3
#define ETH_PHY_STATUS_READY_Pos		4
#define ETH_PHY_STATUS_CRS_Pos			5
#define ETH_PHY_STATUS_COL_Pos			6
#define ETH_PHY_STATUS_FX_VALID_Pos		8
#define ETH_PHY_STATUS_MDO_Pos			9
#define ETH_PHY_STATUS_MDINT_Pos		10

/* Bit field masks: */
#define ETH_PHY_STATUS_LED0				((uint32_t)0x00000001)
#define ETH_PHY_STATUS_LED1				((uint32_t)0x00000002)
#define ETH_PHY_STATUS_LED2				((uint32_t)0x00000004)
#define ETH_PHY_STATUS_LED3				((uint32_t)0x00000008)
#define ETH_PHY_STATUS_READY			((uint32_t)0x00000010)
#define ETH_PHY_STATUS_CRS				((uint32_t)0x00000020)
#define ETH_PHY_STATUS_COL_Msk			((uint32_t)0x000000C0)
#define ETH_PHY_STATUS_FX_VALID			((uint32_t)0x00000100)
#define ETH_PHY_STATUS_MDO				((uint32_t)0x00000200)
#define ETH_PHY_STATUS_MDINT			((uint32_t)0x00000400)

/** @} */ /* End of group ETH_PHY_STATUS */

/** @} */ /* End of group __K1986VE1xI_Periph_ETHERNET Defines */

/** @} */ /* End of group __K1986VE1xI_Periph_ETHERNET */

/** @} */ /* End of group __K1986VE1xI_Peripheral_Units */

/** @defgroup Peripheral_declaration Peripheral declaration
  * @{
  */

#define MDR_CAN1				  ((MDR_CAN_TypeDef 		  *)MDR_CAN1_BASE		  )
#define MDR_CAN2				  ((MDR_CAN_TypeDef 		  *)MDR_CAN2_BASE		  )
#define MDR_USB 				  ((MDR_USB_TypeDef 		  *)MDR_USB_BASE		  )
#define MDR_EEPROM				  ((MDR_EEPROM_TypeDef		  *)MDR_EEPROM_BASE 	  )
#define MDR_RST_CLK 			  ((MDR_RST_CLK_TypeDef 	  *)MDR_RST_CLK_BASE	  )
#define MDR_DMA 				  ((MDR_DMA_TypeDef 		  *)MDR_DMA_BASE		  )
#define MDR_UART1				  ((MDR_UART_TypeDef		  *)MDR_UART1_BASE		  )
#define MDR_UART2				  ((MDR_UART_TypeDef		  *)MDR_UART2_BASE		  )
#define MDR_SSP1				  ((MDR_SSP_TypeDef 		  *)MDR_SSP1_BASE		  )
#define MDR_MIL_STD_15531		  ((MDR_MIL_STD_1553_TypeDef  *)MDR_MIL_STD_15531_BASE)
#define MDR_MIL_STD_15532		  ((MDR_MIL_STD_1553_TypeDef  *)MDR_MIL_STD_15532_BASE)
#define MDR_POWER				  ((MDR_POWER_TypeDef		  *)MDR_POWER_BASE		  )
#define MDR_WWDG				  ((MDR_WWDG_TypeDef		  *)MDR_WWDG_BASE		  )
#define MDR_IWDG				  ((MDR_IWDG_TypeDef		  *)MDR_IWDG_BASE		  )
#define MDR_TIMER1				  ((MDR_TIMER_TypeDef		  *)MDR_TIMER1_BASE 	  )
#define MDR_TIMER2				  ((MDR_TIMER_TypeDef		  *)MDR_TIMER2_BASE 	  )
#define MDR_TIMER3				  ((MDR_TIMER_TypeDef		  *)MDR_TIMER3_BASE 	  )
#define MDR_ADC 				  ((MDR_ADC_TypeDef 		  *)MDR_ADC_BASE		  )
#define MDR_DAC 				  ((MDR_DAC_TypeDef 		  *)MDR_DAC_BASE		  )
#define MDR_TIMER4				  ((MDR_TIMER_TypeDef		  *)MDR_TIMER4_BASE 	  )
#define MDR_SSP2				  ((MDR_SSP_TypeDef 		  *)MDR_SSP2_BASE		  )
#define MDR_PORTA				  ((MDR_PORT_TypeDef		  *)MDR_PORTA_BASE		  )
#define MDR_PORTB				  ((MDR_PORT_TypeDef		  *)MDR_PORTB_BASE		  )
#define MDR_PORTC				  ((MDR_PORT_TypeDef		  *)MDR_PORTC_BASE		  )
#define MDR_PORTD				  ((MDR_PORT_TypeDef		  *)MDR_PORTD_BASE		  )
#define MDR_PORTE				  ((MDR_PORT_TypeDef		  *)MDR_PORTE_BASE		  )
#define MDR_ARINC429R			  ((MDR_ARINC429R_TypeDef	  *)MDR_ARINC429R_BASE	  )
#define MDR_BKP 				  ((MDR_BKP_TypeDef 		  *)MDR_BKP_BASE		  )
#define MDR_ARINC429T			  ((MDR_ARINC429T_TypeDef	  *)MDR_ARINC429T_BASE	  )
#define MDR_PORTF				  ((MDR_PORT_TypeDef		  *)MDR_PORTF_BASE		  )
#define MDR_EBC		  			  ((MDR_EBC_TypeDef           *)MDR_EBC_BASE          )
#define MDR_SSP3				  ((MDR_SSP_TypeDef 		  *)MDR_SSP3_BASE		  )
#define MDR_ETHERNET1			  ((MDR_ETHERNET_TypeDef	  *)MDR_ETHERNET1_BASE	  )

/** @} */ /* End of group Peripheral_declaration */

/** @} */ /* End of group K1986VE1xI_Peripheral K1986VE1xI Peripheral */

/** @} */ /* End of group K1986VE1xI */

/** @} */ /* End of group __CMSIS */

#ifdef __cplusplus
}
#endif

#endif /* __K1986VE1xI_H */

/*
*
* END OF FILE K1986VE1xI.h */

